# RBS Salary Fum Rank

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salary_edited_to_fit_19-20')

In [3]:
rbs = pd.read_csv('../Capstone_csv_file/rbs_fum_rank_19-20')

In [4]:
rbs

                  NAME  FUM  FUM_rank
0      Darwin Thompson    0      18.0
1            Joe Mixon    0      18.0
2           Brian Hill    0      18.0
3         Travis Homer    0      18.0
4   Deandre Washington    0      18.0
..                 ...  ...       ...
92         Carlos Hyde    4      92.5
93       Melvin Gordon    4      92.5
94    Devin Singletary    4      92.5
95       Derrick Henry    5      96.0
96        Chris Carson    7      97.0

[97 rows x 3 columns]

In [5]:
rbs.set_index('NAME', inplace = True)

In [6]:
rbs_final_salary = rbs.merge(salary, on = 'NAME')

In [7]:
rbs_final_salary.set_index('NAME', inplace = True)

In [8]:
rbs_final_salary.head()

                 FUM  FUM_rank   salary
NAME
Joe Mixon          0      18.0  1362544
Chase Edmonds      0      18.0   728090
Marlon Mack        0      18.0   704912
Tevin Coleman      0      18.0  4250000
Latavius Murray    0      18.0  3600000

In [9]:
rbs_final_salary.to_csv('../Capstone_csv_file/rbs_fum_salary_19-20')